src/DataProcessors/Авторизация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>Авторизация</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗначениеВвода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>стрЗначениеВвода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/Catalogs/КартыДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>КартыДоступа</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Блокировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата1</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Привязка</Name>
					<Comment>клиент, сотрудник, место</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ПосадочныеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоШаблон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОдноразовоеИспользование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКартДоступа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформационнаяБаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторHEX</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/Авторизация/Ext/ObjectModule.bsl
#Если Клиент Тогда

Перем ПараметрыОкна Экспорт;	// структура, определяет положение и размеры окна

Перем ТипЗначения	Экспорт;   // тип значения
Перем Длина			Экспорт;   // длина
Перем Точность		Экспорт;   // точность
Перем Кратность		Экспорт;   // кратность
Перем РежимПароля   Экспорт;

Перем ТипПоляВвода	Экспорт;
Перем ФлагОткрытия	Экспорт;
Перем ФлагДроби		Экспорт;
Перем ДробнаяЧасть	Экспорт;

Перем ЗапретОтмены Экспорт;
Перем ПервоеОткрытие Экспорт;

Перем ФормаВвода;

// Обязательная процедура для работы с обработкой через ИнтерфейсРМ.ПолучитьОбъектОбработки()
// Вызывается каждый раз при обращении к объекту обработки.
// Здесь надо прописать сброс переменных в начальные значения
// Реквизиты и табличные части уже сброшены
Процедура УстановкаНачальныхЗначений() Экспорт
	
	ФлагОткрытия	= Ложь;
	ЗапретОтмены 	= Ложь;
	ИнтерфейсРМ.ВыводНаДП("Ожидание");
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Вызывается из обработчика ПередОткрытием форм этой обработки,
// выполняет инициализацию рабочего места
//
Процедура ДействияПередОткрытиемФормы(ТекущаяФорма, Отказ) Экспорт
	
	ФормаВвода = ТекущаяФорма;
	
	Если ТипЗначения = "Пароль" Тогда
		ТипЗначения		= "Строка";
		РежимПароля = Истина;
		Длина			= ?(ЗначениеЗаполнено(Длина),Длина,4);
		ЗначениеВвода	= "";
		ФормаВвода.ЭлементыФормы.ЗначениеВвода.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		ФормаВвода.ЭлементыФормы.ЗначениеВвода.Шрифт = Новый Шрифт(ФормаВвода.ЭлементыФормы.ЗначениеВвода.Шрифт,72);
		//ФормаВвода.ЭлементыФормы.ЗначениеВвода.РежимПароля = Истина;
	Иначе
		РежимПароля = Ложь;
	КонецЕсли; 
	
	Если ТипЗначения = "Строка" Тогда
		ТипПоляВвода = ПолучитьОписаниеТиповСтроки( Длина );
	Иначе
		ТипПоляВвода = ПолучитьОписаниеТиповЧисла( Длина, Точность, Истина );
	КонецЕсли; 
	
	//ФормаВвода.ЭлементыФормы.ЗначениеВвода.ОграничениеТипа = ТипПоляВвода;
	ЗначениеВвода = ТипПоляВвода.ПривестиЗначение(ЗначениеВвода);
	Если РежимПароля Тогда
		стрЗначениеВвода = "▫▫▫▫";
	Иначе
		стрЗначениеВвода = Формат(ЗначениеВвода, "ЧРД=.; ЧГ=0");
	КонецЕсли;
	

	
	ФлагОткрытия	= Истина;
	ФлагДроби		= Ложь;
	ДробнаяЧасть	= 0.1;	
	
		
КонецПроцедуры

Процедура ОбработкаВнешнегоСобытия(Источник, Событие, Данные) Экспорт 
	
	Если НЕ ФормаВвода.ВводДоступен() Тогда
		Возврат;
	КонецЕсли;
	
	_Знач = ОбработкаВнешнихСобытий.ПолучитьДанные(Источник,Событие,Данные);
	
	КартаДоступа = ОбщегоНазначенияПовтИсп.НайтиПоРеквизиту("Справочник.КартыДоступа", "Идентификатор", _Знач);
	
	Если ЗначениеЗаполнено(КартаДоступа) Тогда
		//:КартаДоступа=Справочники.КартыДоступа.ПустаяСсылка();
		Привязка = КартаДоступа.Привязка;
		Если ТипЗнч(Привязка) = Тип("СправочникСсылка.Сотрудники") и ЗначениеЗаполнено(Привязка) Тогда
			ФормаВвода.Закрыть(КартаДоступа.Привязка.КодДоступа);
		Иначе
			ИнтерфейсРМ.ВопросПредупреждение("Ошибка", "Карта доступа", "Карта доступа не привязана ни к одному сотруднику!","","ОК","", , , 5);
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура Сброс() Экспорт
	
	ФлагДроби		= Ложь;
	ДробнаяЧасть	= 0.1;
	ЗначениеВвода	= ТипПоляВвода.ПривестиЗначение();
	стрЗначениеВвода = "▫▫▫▫";
	глОтсечкаПростоя();
	
КонецПроцедуры

Процедура НажатиеКнопки(СтрКнопки) Экспорт
	
		
	Если ФлагОткрытия Тогда
		Сброс();
		ФлагОткрытия = Ложь;
	КонецЕсли;
	
	Если ЗначениеВвода = Неопределено Тогда
		ЗначениеВвода = ?(ТипЗначения="Число", 0, "");
	КонецЕсли;
	
	НовЗнач = ЗначениеВвода;
	
	Если ТипЗначения="Строка" Тогда
		НовЗнач = НовЗнач + СтрКнопки;
		
	ИначеЕсли НЕ ФлагДроби ИЛИ Точность=0 Тогда
		НовЗнач = НовЗнач * ?(СтрКнопки="00",100,10) + Число(СтрКнопки);	
		
	Иначе
		НовЗнач = НовЗнач + Число(СтрКнопки) * ДробнаяЧасть;
		ДробнаяЧасть = ДробнаяЧасть * 0.1;
		
	КонецЕсли;
	
	Если ТипПоляВвода.ПривестиЗначение(НовЗнач) = НовЗнач Тогда
		ЗначениеВвода = НовЗнач;
	КонецЕсли;
	Если РежимПароля Тогда
		стрЗначениеВвода = СокрЛП(ЗначениеВвода);
		стрЗначениеВвода = лев("▪▪▪▪▪▪▪▪▪▪",СтрДлина(стрЗначениеВвода)) + лев("▫▫▫▫▫▫▫▫▫▫", Длина-СтрДлина(стрЗначениеВвода));
	Иначе
		стрЗначениеВвода = Формат(ЗначениеВвода, "ЧРД=.; ЧГ=0");
	КонецЕсли;
		
	Если Длина = СтрДлина(ЗначениеВвода) И РежимПароля Тогда
		ОК();
	КонецЕсли;
	
	глОтсечкаПростоя();
	
КонецПроцедуры

Процедура Точка() Экспорт
	
	Если ФлагОткрытия Тогда
		Сброс();
		ФлагОткрытия = Ложь;
	КонецЕсли;
	
	ФлагДроби = Истина;
	Если не стрНайти(стрЗначениеВвода,".") Тогда
		стрЗначениеВвода = стрЗначениеВвода + ".";
	КонецЕсли;
	
	
КонецПроцедуры
 
Процедура ОК() Экспорт
	
	Если ТипЗначения="Число" И Кратность>0 Тогда
		
		ПровЗнач = ЗначениеВвода / Кратность;
		Если Цел(ПровЗнач)<>ПровЗнач Тогда
			
			Текст1="Ошибка ввода";
			Текст2="Значение должно быть кратно "+Кратность+" !";
			ИнтерфейсРМ.ВопросПредупреждение("Ошибка",Текст1,Текст2, "", "ОК", "");
			
			ФлагОткрытия = Истина;	
			ФормаВвода.ТекущийЭлемент = ФормаВвода.ЭлементыФормы.ЗначениеВвода;
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеВвода = "9999" Тогда
		ФормаВвода.Закрыть("ВыходОС");
	ИначеЕсли ЗначениеЗаполнено(ЗначениеВвода) Тогда
		ФормаВвода.Закрыть( ЗначениеВвода );	
	КонецЕсли;
КонецПроцедуры
 
////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////

ПараметрыОкна = Новый Структура("Центр, Лево, Верх, Ширина, Высота", Истина);


#КонецЕсли
РежимПароля = Ложь;
ПервоеОткрытие = Истина;
